eisup_2019_docmng_integration/src/Catalogs/абс_ОбособленныеПодразделения/абс_ОбособленныеПодразделения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_ОбособленныеПодразделения</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПодразделения</name>
    <type>
      <types>EnumRef.абс_ВидыПодразделений</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКАТО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерПФР</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерФСС</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерФондЗанятости</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтдельныйСчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтдельныйБаланс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводитВыплатыФизЛицам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеПроизводящееНачислениеИВыплатуЗППоФилиалу</name>
    <type>
      <types>CatalogRef.абс_ОбособленныеПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициент</name>
    <comment>(Регл)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТерриториальныеУсловияПФР</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.ТерриториальныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициентРФ</name>
    <comment>(Регл)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_КодИСУЗК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКТМО</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОтветственноеОПпоНалогуНаПрибыль</name>
    <type>
      <types>CatalogRef.абс_ОбособленныеПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйОрган</name>
    <type>
      <types>CatalogRef.НалоговыеОрганы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсторияПереименования</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СтароеНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЮридическая</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтараяДатаЗакрытия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Enums/абс_ВидыПодразделений/абс_ВидыПодразделений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидыПодразделений</name>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
  <enumValues>
    <name>ОбособленноеПодразделение</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <predefined>
    <items>
      <name>EmailОрганизации</name>
      <description>Email организации</description>
    </items>
    <items>
      <name>EmailФизЛица</name>
      <description>Email физ. лица</description>
    </items>
    <items>
      <name>ИнформАдресФизЛица</name>
      <description>Адрес для информирования физ. лица</description>
    </items>
    <items>
      <name>АдресДоставкиКонтрагента</name>
      <description>Адрес доставки</description>
    </items>
    <items>
      <name>ЮрАдресФизЛица</name>
      <description>Адрес по прописке физ. лица</description>
    </items>
    <items>
      <name>ФактАдресФизЛица</name>
      <description>Адрес проживания физ. лица</description>
    </items>
    <items>
      <name>ИнострАдресФизЛица</name>
      <description>Адрес физ. лица за пределами РФ </description>
    </items>
    <items>
      <name>АдресЭлектроннойПочтыКонтактногоЛицаКонтрагента</name>
      <description>Адрес электронной почты контактного лица контрагента</description>
    </items>
    <items>
      <name>АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами</name>
      <description>Адрес электронной почты контрагента для обмена электронными документами</description>
    </items>
    <items>
      <name>КонтактнТелефонКандидата</name>
      <description>Контактн телефон кандидата</description>
    </items>
    <items>
      <name>МобильныйТелефонКонтактногоЛицаКонтрагента</name>
      <description>Мобильный телефон контактного лица контрагента</description>
    </items>
    <items>
      <name>АдресОрганизацииПочтовый</name>
      <description>Почтовый адрес организации</description>
    </items>
    <items>
      <name>РабочийТелефонКонтактногоЛицаКонтрагента</name>
      <description>Рабочий телефон контактного лица контрагента</description>
    </items>
    <items>
      <name>СлужебныйАдресЭлектроннойПочтыПользователя</name>
      <description>Служебный адрес электронной почты пользователя</description>
    </items>
    <items>
      <name>ТелефонКонтрагента</name>
      <description>Телефон контрагента</description>
    </items>
    <items>
      <name>ТелефонОрганизации</name>
      <description>Телефон организации</description>
    </items>
    <items>
      <name>ТелефонПоЮрАдресуОрганизации</name>
      <description>Телефон по юридическому адресу организации</description>
    </items>
    <items>
      <name>ТелефонФизЛица</name>
      <description>Телефон физ.лица домашний</description>
    </items>
    <items>
      <name>ТелефонСлужебный</name>
      <description>Телефон физ.лица служебный</description>
    </items>
    <items>
      <name>АдресИнострОрганизацииУчред</name>
      <description>Учредительный адрес иностранной организации</description>
    </items>
    <items>
      <name>ФаксКонтрагента</name>
      <description>Факс контрагента</description>
    </items>
    <items>
      <name>ФаксОрганизации</name>
      <description>Факс организации</description>
    </items>
    <items>
      <name>ФактАдресКонтрагента</name>
      <description>Фактический адрес контрагента</description>
    </items>
    <items>
      <name>ФактАдресОрганизации</name>
      <description>Фактический адрес организации</description>
    </items>
    <items>
      <name>ЮрАдресКонтрагента</name>
      <description>Юридический адрес контрагента</description>
    </items>
    <items>
      <name>ЮрАдресОрганизации</name>
      <description>Юридический адрес организации</description>
    </items>
  </predefined>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбъектаКонтактнойИнформации</name>
    <type>
      <types>EnumRef.ВидыОбъектовКонтактнойИнформации</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Catalogs/ПодразделенияОрганизаций/ПодразделенияОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодразделенияОрганизаций</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>ВидПодразделения</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ВидыПодразделений</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКАТО</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициент</name>
    <comment>(Регл)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РайонныйКоэффициентРФ</name>
    <comment>(Регл)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТерриториальныеУсловияПФР</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.ТерриториальныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЯвляетсяДирекцией</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЯвляетсяДепартаментом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_КодИСУЗК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОтноситсяКФинСтруктуре</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТипПодразделенияОрганизации</name>
    <type>
      <types>EnumRef.абс_ТипыПодразделенийОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_КатегорияПодразделения</name>
    <type>
      <types>EnumRef.абс_КатегорияПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Блок</name>
    <type>
      <types>CatalogRef.абс_Блоки</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОбособленноеПодразделение</name>
    <type>
      <types>CatalogRef.абс_ОбособленныеПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКТМО</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Удалитьабс_Ответственные</name>
    <attributes>
      <name>ОтветственныйСотрудник</name>
      <type>
        <types>CatalogRef.СотрудникиОрганизаций</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Catalogs/абс_ОбособленныеПодразделения/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ (НА СЕРВЕРЕ)

// Процедура УстановитьВидимость()
// Процедура устанавливает видимость элементов управления формы в зависимости от значения реквизита ВидПодразделения
//
// Параметры:
//  Нет
//
&НаСервере
Процедура УстановитьВидимость()

	Если Объект.ВидПодразделения = Перечисления.абс_ВидыПодразделений.ЮридическоеЛицо Тогда
		
		Элементы.Адрес.Видимость = Ложь;
		Элементы.КПП.Видимость = Ложь;
		Элементы.ОКАТО.Видимость = Ложь;
		Элементы.РегистрационныйНомерПФР.Видимость = Ложь;
		Элементы.РегистрационныйНомерФСС.Видимость = Ложь;
		Элементы.РегистрационныйНомерФондЗанятости.Видимость = Ложь;
		Элементы.ОтдельныйСчет.Видимость = Ложь;
		Элементы.ОтдельныйБаланс.Видимость = Ложь;
		Элементы.ПроизводитВыплатыФизЛицам.Видимость = Ложь;
		Элементы.ПодразделениеПроизводящееНачислениеИВыплатуЗППоФилиалу.Видимость 	= Ложь;
		Элементы.ТерриториальныеУсловияПФР.Видимость = Ложь;
		Элементы.РайонныйКоэффициент.Видимость = Ложь;
		Элементы.РайонныйКоэффициентРФ.Видимость = Ложь;
		
	ИначеЕсли Объект.ВидПодразделения = Перечисления.абс_ВидыПодразделений.Филиал Тогда
		
		Элементы.Адрес.Видимость = Истина;
		Элементы.КПП.Видимость = Истина;
		Элементы.ОКАТО.Видимость = Истина;
		Элементы.РегистрационныйНомерПФР.Видимость = Истина;
		Элементы.РегистрационныйНомерФСС.Видимость = Истина;
		Элементы.РегистрационныйНомерФондЗанятости.Видимость = Истина;
		Элементы.ОтдельныйСчет.Видимость = Истина;
		Элементы.ОтдельныйБаланс.Видимость = Истина;
		Элементы.ПроизводитВыплатыФизЛицам.Видимость = Истина;
		Элементы.ПодразделениеПроизводящееНачислениеИВыплатуЗППоФилиалу.Видимость = Истина;
		
		// {{KM WARE Агапов Н.А. Заявка №32447  16.11.2015 начало
		Элементы.ТерриториальныеУсловияПФР.Видимость = Истина;
		Элементы.РайонныйКоэффициент.Видимость = Истина;
		Элементы.РайонныйКоэффициентРФ.Видимость = Истина;
		// }}KM WARE Агапов Н.А. Заявка №32447 16.11.2015 окончание		
	ИначеЕсли Объект.ВидПодразделения = Перечисления.абс_ВидыПодразделений.ОбособленноеПодразделение Тогда
		
		Элементы.Адрес.Видимость = Истина;
		Элементы.КПП.Видимость = Истина;
		Элементы.ОКАТО.Видимость = Истина;
		Элементы.РегистрационныйНомерПФР.Видимость = Ложь;
		Элементы.РегистрационныйНомерФСС.Видимость = Ложь;
		Элементы.РегистрационныйНомерФондЗанятости.Видимость = Ложь;
		Элементы.ОтдельныйСчет.Видимость = Ложь;
		Элементы.ОтдельныйБаланс.Видимость = Ложь;
		Элементы.ПроизводитВыплатыФизЛицам.Видимость = Ложь;
		Элементы.ПодразделениеПроизводящееНачислениеИВыплатуЗППоФилиалу.Видимость 	= Ложь;
		Элементы.ТерриториальныеУсловияПФР.Видимость = Истина;
		Элементы.РайонныйКоэффициент.Видимость = Истина;
		Элементы.РайонныйКоэффициентРФ.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимость()

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ (НА КЛИЕНТЕ)

// Процедура ФлажкиПриИзменении()
// Процедура устанавливает доступность элементов управления формы в зависимости от установленных "флажков"
//
// Параметры:
//	Нет
//
&НаКлиенте
Процедура ФлажкиПриИзменении()
	
	Если Объект.ОтдельныйСчет И Объект.ОтдельныйБаланс И Объект.ПроизводитВыплатыФизЛицам Тогда
		Элементы.ПодразделениеПроизводящееНачислениеИВыплатуЗППоФилиалу.Доступность = Ложь;
	Иначе
		Элементы.ПодразделениеПроизводящееНачислениеИВыплатуЗППоФилиалу.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ВидПодразделения = Перечисления.абс_ВидыПодразделений.ЮридическоеЛицо;		
		Если ЗначениеЗаполнено(Объект.Родитель) Тогда
			Объект.ГоловнаяОрганизация = Объект.Родитель.ГоловнаяОрганизация;
		Иначе
			Объект.ГоловнаяОрганизация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
		КонецЕсли;
		//+++ Григорьев Д.В. - #7758734 (28.04.2017)
		мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(глЗначениеПеременной("глТекущийПользователь"));	
		Если Не (мРолиПользователя.Найти(Справочники.РолиИсполнителей.ВедениеОбособленныхПодразделений) <> Неопределено Или мРолиПользователя.Найти(Справочники.РолиИсполнителей.СуперПользователь) <> Неопределено) Тогда
			ttk_ОбщегоНазначения.СообщитьОбОшибке("Недостаточно прав для добавления обособленных подразделений!", Отказ);
		КонецЕсли;
		//--- Григорьев Д.В. - #7758734 (28.04.2017)	
	КонецЕсли;
	
	//+++ Григорьев Д.В. - #7758734 (28.04.2017)
	ОбновитьВидимость();
	//--- Григорьев Д.В. - #7758734 (28.04.2017)
	
	УстановитьВидимость();
	ФлажкиПриИзменении();
	//АБС ВСТАВКА №43687 НАЧАЛО «5 июня 2014 г.», Пополитов
	ПолучитьКПП_ОП_Клиент();
	//\\АБС ВСТАВКА №43687 КОНЕЦ
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

&НаКлиенте
Процедура ВидПодразделенияПриИзменении(Элемент)
	
	Если Объект.ВидПодразделения = Перечисления.абс_ВидыПодразделений.Филиал Тогда 
		
		Объект.ОтдельныйСчет 				= Истина;
		Объект.ОтдельныйБаланс 				= Истина;
		Объект.ПроизводитВыплатыФизЛицам 	= Истина;
		
	КонецЕсли;
	УстановитьВидимость();
	ФлажкиПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтдельныйСчетПриИзменении(Элемент)
	ФлажкиПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ОтдельныйБалансПриИзменении(Элемент)
	ФлажкиПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ПроизводитВыплатыФизЛицамПриИзменении(Элемент)
	ФлажкиПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПроизводящееНачислениеИВыплатуЗППоФилиалуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ФормаВыбора = Справочники.абс_ОбособленныеПодразделения.ПолучитьФорму("ФормаВыбора", Элемент);
	
	НовыйОтбор = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
	НовыйОтбор.ВидСравнения 	= ВидСравненияКомпоновкиДанных.ВСписке;
	НовыйОтбор.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("ВидПодразделения");
	
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить(Перечисления.абс_ВидыПодразделений.ОбособленноеПодразделение);
	МассивЭлементов.Добавить(Перечисления.абс_ВидыПодразделений.Филиал);
	
	НовыйОтбор.ПравоеЗначение	= МассивЭлементов;
	НовыйОтбор.Использование 	= Истина;
	НовыйОтбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;

	ФормаВыбора.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура АдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаЗаполненияАдреса = ПолучитьФорму("Справочник.абс_ОбособленныеПодразделения.Форма.ФормаЗаписиАдреса",,Элемент);
	
	//ФормаЗаполненияАдреса.Объект = Объек.Ссылка;
	ФормаЗаполненияАдреса.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	ФормаЗаполненияАдреса.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации;
	
	ФормаЗаполненияАдреса.Представление = Объект.Адрес;
	
	ФормаЗаполненияАдреса.ПроизвольныйАдрес = Ложь;
	
	РезультатВыбораАдреса = ФормаЗаполненияАдреса.ОткрытьМодально();
	
	Если НЕ РезультатВыбораАдреса = Неопределено Тогда
		Объект.Адрес = РезультатВыбораАдреса;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Объект.Адрес = ВыбранноеЗначение.Представление;
	
КонецПроцедуры

//АБС ВСТАВКА 17108				Чистоусов 2012.11.22 15:31:58
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	ТекстСообщения = "";
	//	ПроверитьНеобходимостьПерезаписиСвязанныхПодразделенийНаСервере(ТекстСообщения);
	//	
	//	Если СписокСвязанныхПодразделенийКПерезаписи.Количество() > 0 Тогда
	//		Ответ = Вопрос(ТекстСообщения, РежимДиалогаВопрос.ОКОтмена);
	//		Если Ответ <> КодВозвратаДиалога.ОК Тогда
	//			Отказ = Истина;
	//		КонецЕсли;
	//	КонецЕсли;		
	//	
	//	СписокПодразделений = Новый СписокЗначений;
	//	Если ЕстьОткрытыеФормыПодразделенийПоТекущемуОбособленному(СписокПодразделений) Тогда
	//		стрПодразделения = "";
	//		Для Каждого Элемент Из СписокПодразделений ЦИкл
	//			стрПодразделения = стрПодразделения + ?(ПустаяСтрока(стрПодразделения), "", ", " + Символы.ПС) + "• " + Элемент.Значение;
	//		КонецЦикла;
	//		
	//		Ответ = Вопрос("В данном сеансе есть открытые формы подразделений организаций, которые должны быть перезаписаны:
	//						|
	//						|" + стрПодразделения + "
	//						|
	//						|Если продолжить, все изменения на этих формах будут потеряны.", РежимДиалогаВопрос.ОКОтмена);
	//		Если Ответ <> КодВозвратаДиалога.ОК Тогда 
	//			Отказ = Истина;
	//		КонецЕсли;
	//	КонецЕсли;		
	//КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Функция ЕстьОткрытыеФормыПодразделенийПоТекущемуОбособленному(СписокКлючейФорм = Неопределено)
	
	ЕстьОткрытые = Ложь;
	
	Оповестить("ПолучитьСписокОткрытыхФорм", Объект.Ссылка, ЭтаФорма);
	СписокОткрытыхФорм = Неопределено;
	// будет работать только на толстом клиенте
	ИмяВрПеременной = "____СписокОткрытыхФорм";
	Если глОбщиеЗначения.Свойство(ИмяВрПеременной, СписокОткрытыхФорм) Тогда
		Если ТипЗнч(СписокОткрытыхФорм) = Тип("СписокЗначений") Тогда
			ЕстьОткрытые = Истина;
			Если СписокКлючейФорм <> Неопределено Тогда
				Для Каждого Элемент Из СписокОткрытыхФорм Цикл 
					СписокКлючейФорм.Добавить(Элемент.Значение);
				КонецЦикла;
			КонецЕсли;			
		КонецЕсли;	
		глОбщиеЗначения.Удалить(ИмяВрПеременной);
	КонецЕсли;
	Возврат ЕстьОткрытые;
	
КонецФункции

&НаСервере
Процедура ПроверитьНеобходимостьПерезаписиСвязанныхПодразделенийНаСервере(ТекстСообщения = "")
	
	СписокСвязанныхПодразделенийКПерезаписи.Очистить();
	Если Не Объект.Ссылка.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПодразделенияОрганизаций.Ссылка
		               |ИЗ
		               |	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		               |ГДЕ
		               |	(ПодразделенияОрганизаций.КодПоОКАТО <> &ОКАТО
		               |			ИЛИ ПодразделенияОрганизаций.КПП <> &КПП
		               |			ИЛИ ПодразделенияОрганизаций.РайонныйКоэффициент <> &РайонныйКоэффициент
		               |			ИЛИ ПодразделенияОрганизаций.РайонныйКоэффициентРФ <> &РайонныйКоэффициентРФ
		               |			ИЛИ ПодразделенияОрганизаций.ТерриториальныеУсловияПФР <> &ТерриториальныеУсловияПФР)
		               |	И ПодразделенияОрганизаций.абс_ОбособленноеПодразделение = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		Запрос.УстановитьПараметр("ОКАТО", Объект.ОКАТО);
		Запрос.УстановитьПараметр("КПП", Объект.КПП);
		Запрос.УстановитьПараметр("РайонныйКоэффициент", Объект.РайонныйКоэффициент);
		Запрос.УстановитьПараметр("РайонныйКоэффициентРФ", Объект.РайонныйКоэффициентРФ);
		Запрос.УстановитьПараметр("ТерриториальныеУсловияПФР", Объект.ТерриториальныеУсловияПФР);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		ТекстСообщения = "";
		Пока Выборка.Следующий() Цикл
			СписокСвязанныхПодразделенийКПерезаписи.Добавить(Выборка.Ссылка);
			ТекстСообщения = ТекстСообщения + ?(ПустаяСтрока(ТекстСообщения), "", ", " + Символы.ПС) + "• " + Выборка.Ссылка;
		КонецЦикла;
	КонецЕсли;
	ТекстСообщения = "В следующих подразделениях организаций будут обновлены реквизиты:
					|
					|" + ТекстСообщения + "
					|
					|Продолжить?";
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для Каждого Элемент Из СписокСвязанныхПодразделенийКПерезаписи Цикл
		ТекПодразделениеОбъект = Элемент.Значение.ПолучитьОбъект();
		ТекПодразделениеОбъект.ЗаполнитьРеквизитыПоОбособленномуПодразделению();
		Попытка
			ТекПодразделениеОбъект.Записать();
		Исключение
			Сообщить(ИнформацияОбОшибке().Описание);
			Отказ = Истина;
			Прервать;
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзмененоОбособленноеПодразделение", Объект.Ссылка, ЭтаФорма);
КонецПроцедуры
//\\АБС ВСТАВКА 17108 КОНЕЦ		Чистоусов 2012.11.22 15:31:58

//АБС ВСТАВКА №43687 НАЧАЛО «5 июня 2014 г.», Пополитов 	
&НаКлиенте
Процедура абс_ОтветственноеОПпоНалогуНаПрибыльПриИзменении(Элемент)
	
	ПолучитьКПП_ОП_Клиент();
	
КонецПроцедуры


&НаКлиенте
Процедура ПолучитьКПП_ОП_Клиент()
	
	КПП_ОтветственногоОПпо_налогу_на_прибыль = ПолучитьКПП_ОП_Сервер(Объект.абс_ОтветственноеОПпоНалогуНаПрибыль);
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьКПП_ОП_Сервер(ОП)
	
	Возврат ОП.КПП;	
	
КонецФункции
//\\АБС ВСТАВКА №43687 КОНЕЦ

//+++ Григорьев Д.В. - #7758734 (28.04.2017)
&НаКлиенте
Процедура УстановитьТолькоПросмотрВсемЭлементам(мТолькоПросмотр = Истина)

	Для Каждого Элемент Из Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ДекорацияФормы") Тогда
			Продолжить;
		КонецЕсли;
		Попытка
			Элемент.ТолькоПросмотр = мТолькоПросмотр;
		Исключение
			Элемент.Доступность = Не мТолькоПросмотр;						
		КонецПопытки;
	КонецЦикла;
	
	ЭтаФорма.ТолькоПросмотр = мТолькоПросмотр;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимость()
	
	мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(глЗначениеПеременной("глТекущийПользователь"));	
	Если Не (мРолиПользователя.Найти(Справочники.РолиИсполнителей.ВедениеОбособленныхПодразделений) <> Неопределено Или мРолиПользователя.Найти(Справочники.РолиИсполнителей.СуперПользователь) <> Неопределено) Тогда
		УстановитьТолькоПросмотрВсемЭлементам();
	КонецЕсли;	
	
КонецПроцедуры	
//--- Григорьев Д.В. - #7758734 (28.04.2017)
